# RiserHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLegacyStairOrRamp..::..RiserHeight Property
IFCLegacyStairOrRamp Class See Also
---
The height of riser.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double RiserHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RiserHeight As Double
	Get
```

Visual C++
---
```text
public:
property double RiserHeight {
	double get ();
}
```

# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace